# ExternalResourceMatchOptions Class

---
Represents match options used to filter external resources when listing them from external resource server.
SystemObject Autodesk.Revit.DBExternalResourceMatchOptions
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ExternalResourceMatchOptions : IDisposable

    Public Class ExternalResourceMatchOptions
    	Implements IDisposable

    public ref class ExternalResourceMatchOptions : IDisposable

    type ExternalResourceMatchOptions =
        class
            interface IDisposable
        end
The ExternalResourceMatchOptions type exposes the following members.
| Name| Description
---|---|---
| ExternalResourceMatchOptions|  Constructs new instance with specified resource type.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| ResourceType|  The desired resource type which external resources should match.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ExternalResourceMatchOptions
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace